BAS BMEKZU Project/src/Catalogs/скEDI_Организации/скEDI_Организации.mdo
<?xml version="1.0" encoding="UTF-8"?>
<mdclass:Catalog>
  <name>скEDI_Организации</name>
  <attributes>
    <name>ЮрФизЛицо</name>
    <comment>(Общ)</comment>
    <type>
      <types>EnumRef.скEDI_ЮрФизЛицо</types>
    </type>
  </attributes>
  <attributes>
    <name>Филиал</name>
    <type>
      <types>String</types>
      <stringQualifiers>
        <length>10</length>
      </stringQualifiers>
    </type>
  </attributes>
  <attributes>
    <name>Организация1С</name>
    <type>
      <types>CatalogRef.Организации</types>
    </type>
  </attributes>
  <attributes>
    <name>УдалятьПромежуточныеВерсииЭлектронныхДокументов</name>
    <type>
      <types>Boolean</types>
    </type>
  </attributes>
  <attributes>
    <name>Основная</name>
    <type>
      <types>Boolean</types>
    </type>
  </attributes>
  <attributes>
    <name>АдресЭлектроннойПочты</name>
    <type>
      <types>String</types>
      <stringQualifiers>
        <length>255</length>
      </stringQualifiers>
    </type>
  </attributes>
  <attributes>
    <name>ИдентификаторПрограммы</name>
    <type>
      <types>String</types>
      <stringQualifiers>
        <length>20</length>
      </stringQualifiers>
    </type>
  </attributes>
  <attributes>
    <name>ОбменНалоговымиДокументамиСГФС</name>
    <type>
      <types>Boolean</types>
    </type>
  </attributes>
  <attributes>
    <name>СпособОтправкиНалоговыхДокументовКонтрагенту</name>
    <type>
      <types>EnumRef.скEDI_СпособыОтправкиНалоговыхДокументовКонтрагенту</types>
    </type>
  </attributes>
  <attributes>
    <name>ВыводитьИнформациюОПодписантах</name>
    <type>
      <types>Boolean</types>
    </type>
  </attributes>
  <attributes>
    <name>СМС_УстанавливатьПризнакОбработаноПриОтправкеИсходящегоДокументаКонтрагенту</name>
    <type>
      <types>Boolean</types>
    </type>
  </attributes>
</mdclass:Catalog>

BAS BMEKZU Project/src/Enums/скEDI_СпособыОтправкиНалоговыхДокументовКонтрагенту/скEDI_СпособыОтправкиНалоговыхДокументовКонтрагенту.mdo
<?xml version="1.0" encoding="UTF-8"?>
<mdclass:Enum>
  <name>скEDI_СпособыОтправкиНалоговыхДокументовКонтрагенту</name>
  <enumValues>
    <name>ЧерезСДО</name>
  </enumValues>
  <enumValues>
    <name>ЧерезДФС</name>
  </enumValues>
</mdclass:Enum>

BAS BMEKZU Project/src/Enums/скEDI_ЮрФизЛицо/скEDI_ЮрФизЛицо.mdo
<?xml version="1.0" encoding="UTF-8"?>
<mdclass:Enum>
  <name>скEDI_ЮрФизЛицо</name>
  <comment>(Общ)</comment>
  <enumValues>
    <name>ЮрЛицо</name>
    <comment>(Общ)</comment>
  </enumValues>
  <enumValues>
    <name>ФизЛицо</name>
    <comment>(Общ)</comment>
  </enumValues>
</mdclass:Enum>

BAS BMEKZU Project/src/Catalogs/скEDI_Организации/Forms/ФормаЭлемента/Module.bsl
&НаКлиенте
Функция Проверить(Значение, ОбязательныйСимвол, ЗапретныеСимволы)
	ОбязательныйСимвол = ВРег(ОбязательныйСимвол);
	ЗапретныеСимволы = ВРег(ЗапретныеСимволы);
	ОбязательныйСимволНайден = Ложь;
	Для Н = 1 по СтрДлина(Значение) Цикл
		ТекСимвол = ВРег(Сред(Значение, Н, 1));
		Если ОбязательныйСимволНайден Тогда
			Если ТекСимвол = ОбязательныйСимвол Тогда
				Возврат Ложь;
			КонецЕсли;
		Иначе
			Если ТекСимвол = ОбязательныйСимвол Тогда
				ОбязательныйСимволНайден = Истина;
			КонецЕсли;
		КонецЕсли;
		Если Найти(ЗапретныеСимволы, ТекСимвол) > 0 Тогда
			Возврат Ложь;
		КонецЕсли;
	КонецЦикла;
	Если ОбязательныйСимволНайден Тогда
		Возврат Истина;
	Иначе
		Возврат Ложь;
	КонецЕсли;
КонецФункции


&НаКлиенте
Процедура ПередЗаписью(Отказ, ПараметрыЗаписи)
	Если ЗначениеЗаполнено(Объект.АдресЭлектроннойПочты) Тогда
		Если Не Проверить(Объект.АдресЭлектроннойПочты, "@", "АБВГДЕЁЖЗИЙКЛМНОПРСТУФХЦШЩЪЫЬЭЮЯҐЄІЇ") Тогда
			Сообщить(НСтр("ru = 'Адрес электронной почты не корректный.'; uk = 'Адреса електронної пошти не коректна.'"));
			Отказ = Истина;
		КонецЕсли;
	КонецЕсли;
КонецПроцедуры


&НаСервереБезКонтекста
Функция ПолучитьСписокИдентификаторовПрограммыНаСервере(ЕДРПОУ)
	Возврат скEDI_ОбщегоНазначения.ПолучитьСписокИдентификаторовПрограммы(ЕДРПОУ);
КонецФункции


&НаКлиенте
Процедура ИдентификаторПрограммыНачалоВыбора(Элемент, ДанныеВыбора, СтандартнаяОбработка)
	ДанныеВыбора = ПолучитьСписокИдентификаторовПрограммыНаСервере(Объект.Код);
	СтандартнаяОбработка = Ложь;
КонецПроцедуры


&НаСервере
Процедура ПриСозданииНаСервере(Отказ, СтандартнаяОбработка)
	Если Объект.Ссылка.Пустая() Тогда
		Объект.СпособОтправкиНалоговыхДокументовКонтрагенту = ПредопределенноеЗначение("Перечисление.скEDI_СпособыОтправкиНалоговыхДокументовКонтрагенту.ЧерезДФС");
		Объект.ВыводитьИнформациюОПодписантах = Истина;
	КонецЕсли;
КонецПроцедуры


&НаСервереБезКонтекста
Функция ПолучитьДанныеПоОрганизация1СНаСервере(пОрганизация1С)
	ДанныеПоОрганизаци = скEDI_НастройкиПодКонфигурацию.ПолучитьДанныеПоОгранизации(пОрганизация1С);
	Возврат ДанныеПоОрганизаци;
КонецФункции


&НаКлиенте
Процедура Организация1СПриИзменении(Элемент)
	Если ЗначениеЗаполнено(Объект.Организация1С) Тогда
		ДанныеПоОрганизаци = ПолучитьДанныеПоОрганизация1СНаСервере(Объект.Организация1С);
		Объект.Код = ДанныеПоОрганизаци.ЕДРПОУ;
		Объект.Филиал = ДанныеПоОрганизаци.КодФилиала;
		Объект.Наименование = ДанныеПоОрганизаци.Наименование;
		
		Если СтрДлина(Объект.Код) = 10 Тогда
			Объект.ЮрФизЛицо = ПредопределенноеЗначение("Перечисление.скEDI_ЮрФизЛицо.ФизЛицо");
		Иначе
			Объект.ЮрФизЛицо = ПредопределенноеЗначение("Перечисление.скEDI_ЮрФизЛицо.ЮрЛицо");
		КонецЕсли;
	КонецЕсли;
КонецПроцедуры
